In [1]:
%load_ext sql

In [2]:
%sql sqlite:///chinook.db

In [3]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',)]

In [4]:
%sql PRAGMA table_info(playlists);

 * sqlite:///chinook.db
Done.

[(0, 'PlaylistId', 'INTEGER', 1, None, 1),
 (1, 'Name', 'NVARCHAR(120)', 0, None, 0)]

In [5]:
%sql PRAGMA table_info(tracks);

 * sqlite:///chinook.db
Done.

[(0, 'TrackId', 'INTEGER', 1, None, 1),
 (1, 'Name', 'NVARCHAR(200)', 1, None, 0),
 (2, 'AlbumId', 'INTEGER', 0, None, 0),
 (3, 'MediaTypeId', 'INTEGER', 1, None, 0),
 (4, 'GenreId', 'INTEGER', 0, None, 0),
 (5, 'Composer', 'NVARCHAR(220)', 0, None, 0),
 (6, 'Milliseconds', 'INTEGER', 1, None, 0),
 (7, 'Bytes', 'INTEGER', 0, None, 0),
 (8, 'UnitPrice', 'NUMERIC(10,2)', 1, None, 0)]

In [6]:
%sql PRAGMA table_info(customers);

 * sqlite:///chinook.db
Done.

[(0, 'CustomerId', 'INTEGER', 1, None, 1),
 (1, 'FirstName', 'NVARCHAR(40)', 1, None, 0),
 (2, 'LastName', 'NVARCHAR(20)', 1, None, 0),
 (3, 'Company', 'NVARCHAR(80)', 0, None, 0),
 (4, 'Address', 'NVARCHAR(70)', 0, None, 0),
 (5, 'City', 'NVARCHAR(40)', 0, None, 0),
 (6, 'State', 'NVARCHAR(40)', 0, None, 0),
 (7, 'Country', 'NVARCHAR(40)', 0, None, 0),
 (8, 'PostalCode', 'NVARCHAR(10)', 0, None, 0),
 (9, 'Phone', 'NVARCHAR(24)', 0, None, 0),
 (10, 'Fax', 'NVARCHAR(24)', 0, None, 0),
 (11, 'Email', 'NVARCHAR(60)', 1, None, 0),
 (12, 'SupportRepId', 'INTEGER', 0, None, 0)]

In [7]:
%sql SELECT * FROM customers LIMIT 6;

 * sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4),
 (6, 'Helena', 'Holý', None, 'Rilská 3174/6', 'Prague', None, 'Czech Republic', '14300', '+420 2 4177 0449', None, 'hholy@gmail.com', 5)]

In [8]:
%sql SELECT * FROM tracks LIMIT 7;

 * sqlite:///chinook.db
Done.

[(1, 'For Those About To Rock (We Salute You)', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 343719, 11170334, 0.99),
 (2, 'Balls to the Wall', 2, 2, 1, None, 342562, 5510424, 0.99),
 (3, 'Fast As a Shark', 3, 2, 1, 'F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman', 230619, 3990994, 0.99),
 (4, 'Restless and Wild', 3, 2, 1, 'F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman', 252051, 4331779, 0.99),
 (5, 'Princess of the Dawn', 3, 2, 1, 'Deaffy & R.A. Smith-Diesel', 375418, 6290521, 0.99),
 (6, 'Put The Finger On You', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 205662, 6713451, 0.99),
 (7, "Let's Get It Up", 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 233926, 7636561, 0.99)]

In [9]:
%sql SELECT * FROM artists LIMIT 4;

 * sqlite:///chinook.db
Done.

[(1, 'AC/DC'), (2, 'Accept'), (3, 'Aerosmith'), (4, 'Alanis Morissette')]

In [10]:
%sql SELECT Name FROM tracks LIMIT 6;

 * sqlite:///chinook.db
Done.

[('For Those About To Rock (We Salute You)',),
 ('Balls to the Wall',),
 ('Fast As a Shark',),
 ('Restless and Wild',),
 ('Princess of the Dawn',),
 ('Put The Finger On You',)]

In [11]:
%sql SELECT Phone FROM customers LIMIT 8;

 * sqlite:///chinook.db
Done.

[('+55 (12) 3923-5555',),
 ('+49 0711 2842222',),
 ('+1 (514) 721-4711',),
 ('+47 22 44 22 22',),
 ('+420 2 4172 5555',),
 ('+420 2 4177 0449',),
 ('+43 01 5134505',),
 ('+32 02 219 03 03',)]

In [12]:
%sql SELECT Address FROM customers LIMIT 7;

 * sqlite:///chinook.db
Done.

[('Av. Brigadeiro Faria Lima, 2170',),
 ('Theodor-Heuss-Straße 34',),
 ('1498 rue Bélanger',),
 ('Ullevålsveien 14',),
 ('Klanova 9/506',),
 ('Rilská 3174/6',),
 ('Rotenturmstraße 4, 1010 Innere Stadt',)]

In [13]:
%sql SELECT City FROM customers LIMIT 8;

 * sqlite:///chinook.db
Done.

[('São José dos Campos',),
 ('Stuttgart',),
 ('Montréal',),
 ('Oslo',),
 ('Prague',),
 ('Prague',),
 ('Vienne',),
 ('Brussels',)]

In [14]:
%%sql CREATE TABLE lecture(
    First_Name VARCHAR(20),
    Last_Name VARCHAR(20),
    Department VARCHAR(30),
    Salary INT (15),
    Worker_Id INT NOT NULL PRIMARY KEY,
    Age INT(3)
);

 * sqlite:///chinook.db
Done.

[]

In [15]:
%sql SELECT name FROM sqlite_master WHERE type=='table';

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',),
 ('lecture',)]

In [16]:
%sql PRAGMA table_info("lecture");

 * sqlite:///chinook.db
Done.

[(0, 'First_Name', 'VARCHAR(20)', 0, None, 0),
 (1, 'Last_Name', 'VARCHAR(20)', 0, None, 0),
 (2, 'Department', 'VARCHAR(30)', 0, None, 0),
 (3, 'Salary', 'INT (15)', 0, None, 0),
 (4, 'Worker_Id', 'INT', 1, None, 1),
 (5, 'Age', 'INT(3)', 0, None, 0)]

In [17]:
%%sql ALTER TABLE lecture
ADD email VARCHAR (40);

 * sqlite:///chinook.db
Done.

[]

In [18]:
%sql PRAGMA table_info("lecture");

 * sqlite:///chinook.db
Done.

[(0, 'First_Name', 'VARCHAR(20)', 0, None, 0),
 (1, 'Last_Name', 'VARCHAR(20)', 0, None, 0),
 (2, 'Department', 'VARCHAR(30)', 0, None, 0),
 (3, 'Salary', 'INT (15)', 0, None, 0),
 (4, 'Worker_Id', 'INT', 1, None, 1),
 (5, 'Age', 'INT(3)', 0, None, 0),
 (6, 'email', 'VARCHAR (40)', 0, None, 0)]